package ru.friendforpet.data.repositoies

import kotlinx.coroutines.flow.Flow
import kotlinx.coroutines.flow.flow
import ru.friendforpet.model.Pet
import javax.inject.Inject

class PetsListRepo @Inject constructor() {
    //Ф-ция возвращает экземпляр класса Pet
    fun petListRepoMock(): Flow<Pet> = flow {
        emit(
            Pet(
                141983,
                "Мухтар",
                "Мальчик",
                3,
                "Москва",
                "Большая",
                "Дружелюбная",
                "Длинношерстная",
                "Черно-рыжий",
                "Отзывчивый, обучаемый, спокойный, ладит с детьми",
                listOf(
                    "Дружелюбный", "Приучен к поводку", "Без агрессии", "Овчарка"
                ),
                "23.03.2021",
                "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
            )
        )
    }


    //Функция возвращает список объектов класса Pet
    fun getPetsList(): Flow<List<Pet>> = flow {
        emit(
            listOf(
                Pet(
                    141983,
                    "Мухтар",
                    "Мальчик",
                    3,
                    "Москва",
                    "Большая",
                    "Дружелюбная",
                    "Длинношерстная",
                    "Черно-рыжий",
                    "Отзывчивый, обучаемый, спокойный, ладит с детьми",
                    listOf(
                        "Дружелюбный", "Приучен к поводку", "Без агрессии", "Овчарка"
                    ),
                    "23.03.2021",
                    "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
                ),
                Pet(
                    141984,
                    "Ника",
                    "Девочка",
                    2,
                    "Москва",
                    "Большая",
                    "Дружелюбная",
                    "Длинношерстная",
                    "Бело-рыжий",
                    "Отзывчивая, обучаемая, спокойная, ладит с детьми",
                    listOf(
                        "Дружелюбный", "Приучен к поводку", "Без агрессии", "Сенбернар", "Спасатель"
                    ),
                    "23.03.2021",
                    "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
                ),
                Pet(
                    141985,
                    "Мухтар",
                    "Мальчик",
                    3,
                    "Москва",
                    "Большая",
                    "Дружелюбная",
                    "Длинношерстная",
                    "Черно-рыжий",
                    "Отзывчивый, обучаемый, спокойный, ладит с детьми",
                    listOf(
                        "Дружелюбный", "Приучен к поводку", "Без агрессии", "Овчарка"
                    ),
                    "23.03.2021",
                    "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
                ),
                Pet(
                    141986,
                    "Ника",
                    "Девочка",
                    2,
                    "Москва",
                    "Большая",
                    "Дружелюбная",
                    "Длинношерстная",
                    "Бело-рыжий",
                    "Отзывчивая, обучаемая, спокойная, ладит с детьми",
                    listOf(
                        "Дружелюбный", "Приучен к поводку", "Без агрессии", "Сенбернар", "Спасатель"
                    ),
                    "23.03.2021",
                    "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
                ),
                Pet(
                    141987,
                    "Мухтар",
                    "Мальчик",
                    3,
                    "Москва",
                    "Большая",
                    "Дружелюбная",
                    "Длинношерстная",
                    "Черно-рыжий",
                    "Отзывчивый, обучаемый, спокойный, ладит с детьми",
                    listOf(
                        "Дружелюбный", "Приучен к поводку", "Без агрессии", "Овчарка"
                    ),
                    "23.03.2021",
                    "https://avatars.mds.yandex.net/get-marketcms/1357599/img-61abb65d-e207-4e08-8eef-1499fc23b460.jpeg/optimize"
                )
            )
        )
    }
}